{
	"RandomWorldName_Noun": {
		"the Angler": "the Fisher"
	},
	"NPCName": {
		"Angler": "Fisher",
		"SleepingAngler": "Unconscious Fisher"
	},
	"Bestiary_FlavorText": {
		"npc_Angler": "The youngest member of the Fishermans' Guild, the Fisher is precocious in more than one way. She rewards random items in exchange for exotic specimens."
	},
	"AnglerQuestChatter": {
		"Chatter_1": "That's {AnglerCompletedQuestsCount} contracts down! Keep up the good work!",
		"Chatter_2": "So far, we've shipped {AnglerCompletedQuestsCount} fish back overseas! The more rare specimens get to the Guild, the more treasure comes back to us!"
	},
	"AnglerQuestText": {
		"NoQuest_1": "We're done for the day! Time to take a load off!",
		"NoQuest_2": "Guild regulations mean we only get one contract per day, so please come back tomorrow!",
		"NoQuest_3": "We already finished the job, {PlayerName}. Did you come back just to look at my boobs?",
		"NoQuest_4": "Thanks for the help today, {PlayerName}! While you're here, could you give my shoulders a rub?",
		"NoQuest_5": "We're still waiting on word back from the Guild. New jobs usually come in at 4:30 in the morning!",
		"TurnIn_1": "Surprised you couldn't sell it? The Guild has a monopoly on these kinds of fish-- And here's your cut!",
		"TurnIn_2": "Nice work, {PlayerName}! If it'll motivate you to keep it up, you can... touch them a bit, if you want?",
		"TurnIn_3": "Great catch! Stick it right in there-- In the box, not in my boobs!",
		"TurnIn_4": "Contract complete! I managed to get these for you through my liasion!",
		"TurnIn_5": "Look at the size of that thing! Where'd you get such a big one, {PlayerName}? The fish, that is?",
		"Quest_Batfish": "Today we're looking for a Batfish! It's an underground cousin of the flying fish, and I heard it attacks thieves!\n\n(Caught in Underground & Caverns)",
		"Quest_BumblebeeTuna": "The subterranean jungles of {WorldName} have the weirdest things! The Bumblebee Tuna can swim and breathe in an environment of pure honey! I'm, uh, allergic to bees, though...\n\n(Caught in Honey)",
		"Quest_Catfish": "I got confused when the Guid put up a contract for catfish, but supposedly there's an actual fuzzy fish-cat living in the jungle! I hope they make good pets!\n\n(Caught in Jungle Surface)",
		"Quest_Cloudfish": "I've got it on good authority that there's a fish that's not only living in the clouds, but made of cloud! I don't know how you're going to get up there, but it sounds fragile, so please be careful handling it!\n\n(Caught in Sky Lakes)",
		"Quest_Cursedfish": "There's a cursed fish swimming in the waters of the deepest corruption! It was forged of the cursed flames that spread from the fallen horrors that lurk down there. They say not even water can put out this fire, and that it can burn forever. Scary! I wonder what the Guild could possibly want with it.\n\n(Caught in Corruption)",
		"Quest_Dirtfish": "Dirtfish! It's a fish made of dirt! Or maybe it's covered in dirt, to protect itself from predators? I guess we won't know until we catch one-- they're more valuable overseas than dirt blocks!\n\n(Caught in Surface & Underground)",
		"Quest_DynamiteFish": "The demolitionist taught me about dynamite fishing today, and I think that this is the start of a beautiful friendship! The only thing is, when he tried demonstrating it, the stick of dynamite turned into a fish! If it really happened and it wasn't just the sulfur messing with my head, the Guild wants it!\n\n(Caught in Surface)",
		"Quest_EaterofPlankton": "We've got a bounty for the Eater of Plankton today. Supposedly it mutated from a piece of the Eater of Worlds, but plankton live in the ocean... I guess they just had to work with the name-- one we get it to Guild researchers, we can find out what it really eats!\n\n(Caught in Corruption)",
		"Quest_FallenStarfish": "Aren't those falling stars so pretty? Apparently, some of them are actually fish from space that disguise themselves like that to avoid space predators! We've gotta learn more about their life cycle!\n\n(Caught in Sky Lakes)",
		"Quest_TheFishofCthulu": "Apparently some of those flying eyeballs that come out at night have adapted to live in water! I'm not sure it's technically a fish, but we don't have a 'Cthulhu' overseas, and my liasion tells me it's still in the Guild's jurisdiction.\n\n(Caught in Sky Lakes & Surface)",
		"Quest_Fishotron": "Fish hands! Undead fish with HANDS! They're skeletons, and supposedly possessed by evil spirits, but a fish with hands belong in a museum for sure! We'll get a nice commission, and I'll win a bet, too!\n\n(Caught in Caverns)",
		"Quest_Harpyfish": "I heard a crazy story about a fish with wings! Not a flying fish-- it had the girl's head, too! Is she more closely related to a harpy or a mermaid? Do wizards have any sense of right and wrong? There's only one way to find out!\n\n(Caught in Sky Lakes & Surface)",
		"Quest_Hungerfish": "Have you heard legends about the Wall of Flesh? Supposedly, some chunks break off and form small fish-like things that swim around aimlessly in the underworld like vaugely fish-shaped pieces of ancient history!\n\n(Caught in Caverns)",
		"Quest_Ichorfish": "Did you know deep in the crimson, some of those creatures make this gross yellow stuff? Normally this would be the Alchemists' Guild's purview, but there's supposedly a fish made out of the stuff, so we can get a leg up on them!\n\n(Caught in Crimson)",
		"Quest_Jewelfish": "Are you ready for some conservation work? There's an endangered species of rockfish deep underground that grows gemstones on its body; The Guild wants them so they can influence the precious stones market, but we'll be preserving wildlife too!\n\n(Caught in Underground & Caverns)",
		"Quest_MirageFish": "Deep in Hallowed caverns, purity and goodness become so concentrated humans can't fully comprehend it with our senses-- that's what our researchers told me, anyway, and they theorize a fish with eye-bending illusionary properties that we could exploit.\n\n(Caught in Underground Hallow)",
		"Quest_MutantFlinxfin": "What the heck is a Flinx, anyway? These fluffy things, too, have somehow mutated into fish, according to explorers, so it's up to us to investigate!\n\n(Caught in Underground Tundra)",
		"Quest_Pengfish": "Pengifish are like penguins and fish at the same time! They're cute and make good pets, but they have the weaknesses of both and the strengths of neither, meaning they're easy prey for predators and poachers; the Guild wants one as part of their repopulation program.\n\n(Caught in Tundra)",
		"Quest_Pixiefish": "There's a really really rare type of pixie that's born with so many wings that it can't actually fly! It swims with the fishes in Hallowed lakes, and while it's not actually a fish, my liasion tells me it falls clase enough into the legal definition that the Guild wants them.\n\n(Caught in Hallow)",
		"Quest_Spiderfish": "Spiderfish~ Spiderfish~ Does whatever a spiderfish can~ It's got eight legs and spins silk like a spider, but it's also a fish~ We get it for the Guild, and we'll all get rich!\n\n(Caught in Underground & Caverns)",
		"Quest_UnicornFish": "Unicorns and rainbows are absolutely great! They're everywhere, even in the water. The Hallow is so pure, even some of the fish turn into unicorns, like really tiny magical narwhals! The moment word of their existence got out, people overseas are clamoring to have them as pets!\n\n(Caught in Hallow)",
		"Quest_GuideVoodooFish": "This is a weird one-- According to legend, demons fashion voodoo dolls of despised mortals out of damned souls, but a handful of them escape from the Underworld-- and the souls turn into human-faced fish! It's hard to say if they're still people as such, but if we can find one, we can get it to a wizard and see if they can change it back!\n\n(Caught in Caverns)",
		"Quest_Wyverntail": "Allegedly, those wyrms that fly around at the edge of space are actually a species of amphibian that spawn in sky-lakes-- if we can get our hands on one of their larva, it'll expand our understanding of the whole airborne ecosystem!\n\n(Caught in Sky Lakes)",
		"Quest_ZombieFish": "Fishermen keep getting attacked by zombified fish! These aren't rare, but they're a pest, and the Guild is paying us for proof that we're removing them from our waters!\n\n(Caught in Surface)",
		"Quest_AmanitaFungifin": "In mushroom fields dense enough that their spores block out sunlight, everything glows a brilliant blue! Some of the fungus forms a sympiotic relationship with local fish, too, and the Guild wants a sample of these glowing fungus-fish.\n\n(Caught in Glowing Mushroom Fields)",
		"Quest_Angelfish": "Guild researchers conjecture that since Heaven is made of clouds, and clouds are made of water... Where there's water, there's fish, and angels should exist alongside angel-fish! They're willing to pay us to test their idea, too!\n\n(Caught in Sky Lakes)",
		"Quest_BloodyManowar": "Bloody Man-O-Wars are the most menacing jellyfish in all of {WorldName}! They're mutated by the Crimson and super poisonous-- obviously, the Fishermans' Guild wants to extort the Alchemists' Guild for access to it.\n\n(Caught in Crimson)",
		"Quest_Bonefish": "Whatever mysterious force in {WorldName} animates all of the skeletons and zombies you see, apparently it sometimes works on fishbones! I can't imagine it'd be good for eating or as a pet, but I'm sure a skeleton fish has some kind of use. It is still a skeleton, though, so you might want to stay away from its jaws!\n\n(Caught in Underground & Caverns)",
		"Quest_Bunnyfish": "We're hunting rabbits! There have been unconfirmed sightings of Bunnyfish, a rare aquatic, legless rabbit, and the Guild wants us to catch one for study! Maybe catch two so we can keep one as a pet?\n\n(Caught in Surface)",
		"Quest_CapnTunabeard": "Legends tell of a pirate captain who once had a pet fish named Cap'n Tunabeard. While the pirate was forgotten, the fish was the first of its kind to receive prosthetics! Supposedly, it's still alive somewhere out there-- unless pirates have been going around sticking hooks and pegs on other fish, too. It's a chance to help advance fish medicine!\n\n(Caught in Ocean)",
		"Quest_Clownfish": "Why do they call them Clownfish if they're not painted like clowns? They're endangered, of course, thanks to zombies trampling their reefs, so this is a conservation mission.\n\n(Caught in Ocean)",
		"Quest_DemonicHellfish": "Ancient textd don't give much detail on fish in the Underworld, but they say that magma runs like water there-- and where there's water, there's fish! Guild researchers speculate that if demons live there, then demonic fish might live in their magma seas, if we can find them.\n\n(Caught in Caverns)",
		"Quest_Derpfish": "Is Derpling a scientific name? It kind of undersells how dangerous they are, but there's a rare, harmless, aquatic version that's been spotted in the jungle. Just be careful of the real Derplings while hunting for a false one!\n\n(Caught in Jungle Surface)",
		"Quest_Fishron": "There's a legend of a mighty being known as the Fishron! It's part pig, part dragon, and part FISH! It's supposed to hang around in the frozen subterranean lakes of the coldest part of the world, and the Guild's confident enough that it exists that they're putting a price on it! Let's catch the strongest fish in the world!\n\n(Caught in Underground Tundra)",
		"Quest_InfectedScabbardfish": "We're looking for a really long fish that looks like a sword's sheath, and swims in the murky waters of the corruption! What could possibly have caused it to take on such a weird shape? Is there a species of swordfish out there that actually looks like a sword?\n\n(Caught in Corruption)",
		"Quest_Mudfish": "Mudfish used to be really common, but overfishing pretty much wiped them out before the Guild came in. We can still find them here, though, so we might be able to revive historical populations overseas!\n\n(Caught in Jungle)",
		"Quest_TropicalBarracuda": "Barracuda are sleek, shiny, dangerous, and seldom seen, like arrows made out of silver! Like silver arrows, though, they're expensive, and no match for an experienced angler!\n\n(Caught Jungle Surface)",
		"Quest_TundraTrout": "We're looking for a rare species of trout that's particular to cold climates-- so cold that they encase themselves in ice as a form of natural armor! They're super valuable, both for research and as a delicacy!\n\n(Caught in Surface Tundra)",
		"Quest_Slimefish": "I spotted a fish made out of slime yesterday! It doesn't float on the surface like other slimes, so the slime in its body must be different somehow, and Guild researchers are interested in studying it!\n\n(Caught in Surface Forest)",
		"Quest_ScarabFish": "I read this ancient story about a fish that looks like a magical scarab! My sources tell me there are a few still alive out there, too-- if we can catch one, the Guild will pay top dollar, and we might save them from extinction!\n\n(Caught in Desert)",
		"Quest_ScorpioFish": "Have you found any oases in the Desert? The Guild tells me that explorers found a fish in the shape of a scorpion, and it's all the rage! Supply can't keep up with demand, so the they're putting a premium on them if you can find us one. Just don't get pinched or stung-- they're fiesty!\n\n(Caught in Desert)"
	},
	"AnglerChatter": {
		"Chatter_1": "Maaan~ All the veteran anglers drink after a hard day's work, but {Bartender} won't sell me anything! I'll let you touch my boobs if you sneak me some ale!",
		"Chatter_2": "Heya, {PlayerName}! What's up?",
		"Chatter_3": "Hm? These? My boobies? My huge freakin' titties? My super stuffed milkers? My shirt-stretching sweater puppies? Ahahaha, the look on your face~!",
		"Chatter_4": "So what if I have a boy's name? You can tell I'm a girl, right?",
		"Chatter_5": "To think they've gotten this big, even though I'm only-- Hey, what was that noise?",
		"Chatter_6": "Just because we're working together doesn't mean I can just show them to you, you know. Maybe if you help me with some more fishing contracts...",
		"Chatter_7": "Hmm, something about this spot seems fishy...",
		"Chatter_8": "{WorldName} is filled to the brim with the most outlandish kinds of fish!",
		"Chatter_9": "I wonder what all fish used to live here before I was born. To think I'll never get to see them outside of books...",
		"Chatter_10": "I don't have a mommy or a daddy, but... I have you at least, right {PlayerName}?"
	},
	"AnglerSpecialText": {
		"Party": "Here's to a good catch, {PlayerName}!",
		"Graveyard1": "There's spooky scary skeletons out there! It's driving me insane!",
        "Graveyard2": "There aren't any g-ghost fish out here... are there?",
		"Windy1": "Watch your hooks in this wind! {Nurse} said she wouldn't pull it out the next time I stuck myself!",
		"Windy2": "Could you help me put my hair up? I'm trying to fish, but it keeps blowing into my face...",
		"Storm1": "Nothing whips up the fish like a good thunderstorm! Just make sure you don't bring a metal rod!",
		"Storm2": "Exciting weather, huh? My hair's a mess, but let's get fishing first and take a bath afterwards!",
		"Rain1": "Ah, my shirt's soaked through... Let me just take this off...",
		"Rain2": "The rain brings all the fish to the surface, so now's a great time! Get out there and catch some big ones!",
		"BloodMoonFishing1": "There's so much blood in the water... The sharks must be going crazy.",
		"BloodMoonFishing2": "When the water goes all bloody, do you ever wonder if there are tiny fish living inside of you?"
	},
	"TownNPCMood_Angler": {
		"Content": "The fish are biting, and I'm doing great!",
		"NoHome": "It's a bit drafty out here, don'tcha think? I could use somewhere to stay...",
		"FarFromHome": "Uh, it looks like I got a little lost... Could you take me home with you?",
		"DislikeCrowded": "It's getting a little crowded here, isn't it? All these people keep spooking the fish!",
		"HateCrowded": "We're packed in here like sardines-- Can't a girl get some alone time?!",
		"LoveSpace": "I like all the space! Plenty of room for you and me... and our fish!",
		"LikeBiome": "Hehe, there's always more fish in the sea~!",
		"LoveBiome": "I love {BiomeName}.",
		"DislikeBiome": "There's, uh... A lot of sand, but not a lot of water in a {BiomeName}, you know?",
		"HateBiome": "Who the heck would live in the {BiomeName}?! When I said I wanted the fish to bite, I didn't mean ME!",
		"LikeNPC": "{NPCName} is a professional! I like people who respect hard work, even though I'm a kid!",
		"LoveNPC": "I love being around {NPCName}.",
		"DislikeNPC": "I dislike {NPCName}.",
		"HateNPC": "The next time {NPCName} calls me 'squirt', I'm gonna stick fish heads under his pillow.",
		"LikeNPC_Princess": "{NPCName} is so pretty! It's nice to be around a girl my age!"
	},
	"LegacyDialog": {
		"334": "We've got a new contract from the Guild! Get it while it's hot!",
		"335": "Looking for work, {PlayerName}? There's this rare fish...",
		"336": "You want treasure, and the Fishermans' Guild wants exotic fish! Let's do some capitalism!",
		"337": "Heya, {PlayerName}! We've got a new job! Come take a look!",
		"338": "Is it really that strange for kids to have boobs this big? My little sister's are even bigger!",
		"339": "Are my boobs really that interesting to look at?",
		"347": "I thought I'd get something new to wear from {Clothier}, but he didn't have anything in my size...",
		"348": "You sure you wanna work through a Blood Moon? There IS a job for you...",
		"349": "Zombies can't stop the Fishermans' Guild! Just think of the gold you get from them as hazard pay!",
		"350": "Can it please be day already? It's too scary out there to sleep...",
		"351": "You're going out there? Make sure it's just the fish that bite and not the zombies...",
		"352": "There's a bajillion monsters running around out there right now!",
		"353": "Whew... It's a good thing these float, huh?",
		"354": "What... happened? You... You saved me, right? Thank you so much!",
		"355": "Where... am I? Me? I'm an ace member of the Fishermans' Guild! Maybe we can help each other out more in the future!",
	}
}