{
	"BartenderNames": {      
        	"Andrew": "Tavi",
        	"Barkeep": "Tavi",
        	"Bill": "Tavi",
        	"Blacksmith": "Tavi",
        	"Bruce": "Tavi",
        	"Dale": "Tavi",
        	"Dani Moo": "Tavi",
        	"Driscan": "Tavi",
            	"Elandrian": "Tavi",
            	"Ernest": "Tavi",
            	"Iamisom": "Tavi",
            	"Javahawk": "Tavi",
            	"Jerry": "Tavi",
            	"Moe": "Tavi",
            	"Paddy": "Tavi",
            	"Ted": "Tavi",
            	"William": "Tavi"
	},
	"BartenderChatter": {
		"Chatter_1": "Yeah go on, keep staring at my tits. Take it all in. Last thing you're gonna see, asshole.",
		"Chatter_2": "Groping costs extra, pal.",
		"Chatter_3": "I know what you're thinking. Yes, I'm a maid. No, I'm not one of THOSE maids. These things are as dry as a desert.",
		"Chatter_4": "Talking to you is not much of an upgrade from wiping that table all day.",
		"Chatter_5": "You have more dick in your personality than you do in your pants.",
		"Chatter_6": "No, not even you can afford the top shelf.",
		"Chatter_7": "Before you ask, you make me want to staple my cunt shut.",
		"Chatter_8": "You’re impossible to underestimate.",
		"Chatter_9": "{Dryad}'s is cute. ...She's a bit of a slut, but at least she's not you.",
		"Chatter_10": "Do you think {Steampunker} has a spare gun I can borrow? You keep talking to me.",
		"Chatter_11": "No wonder {Demolitionist} has so many accidents. You probably keep talking to him too.",
		"Chatter_12": "You'd think a beady-eyed bastard like {GoblinTinkerer} would be able to see when he leaves his 'inventions' behind",
		"Chatter_13": "{?Day}Anyone see where the Dryad went? She's got £15 on her tab and I'm not letting her fuck off without paying.",
		"Chatter_14": "{?!Day}Oh you're still alive.",
		"Chatter_15": "{?!Day}It's day outside, go elsewhere, the bar isn't open.",
		"Chatter_16": "{?BloodMoon}A Blood Moon is actually just an excuse to get some time away from you.",
		"Chatter_17": "{?MoonLordDefeated}So the Moonlord didn't manage to kill you? Huh, how about that.",
		"Chatter_18": "{?HardMode}Can you grab me some lavastone to be burn my eyes out with? You're a pretty nasty sight.",
		"Chatter_19": "{?Homeless}The world must be going to shit if I'm out here asking you to build me a place."
	},
	"BartenderHelpText": {
		"Help_1": "It's a bit of a shame how I'm the only person in this place that can tell you about the Old One's army, isn't it?",
		"Help_2": "You can use these artifacts to create traps and defensive towers. Doing so consumes Etherian mana, a special energy dropped only by members of the Old One's Army!",
		"Help_3": "Challenging the Old One's Army is rather simple. They are attracted to the power of the Eternia Crystals, and that can be used to bait them out.",
		"Help_4": "To place an Eternia Crystal, you must obtain an Eternia Crystal and a stand to put it in. It just so happens, you can buy em from me!",
		"Help_5": "You'll want to place your Eternia Crystal stand in a pretty open, flat area. Lots of walls and stuff might make it pretty difficult to protect!",
		"Help_6": "Once your stand is set up, just interact with it while holding an Eternia Crystal, and prepare for a fight!",
		"Help_7": "Of course, you can't let the Old One's Army destroy the Eternia Crystal! This will have catastrophic consequences for my home world of Etheria!",
		"Help_8": "You can place defenses at the cost of 10 Etherian mana. Once placed, the Eternia Crystal will release some of this mana. Otherwise, you will need to defeat enemies to get more.",
		"Help_9": "With the help of the defenses, you will have to repel several waves of invaders who are attempting to destroy both you and the Eternia Crystal!",
		"Help_10": "If you successfully repel the invasion, you'll be awarded with more Defender Medals, which you can bring to me to purchase more artifacts and some other special rewards!",
		"Help_11": "I've also heard rumors that the power of the artifacts themselves may be further unlocked if you defeat the Old One's Army. Perhaps you could even use them any time you wish!"
	},
	"BartenderSpecialText": {
		"FirstHelp": "Take a few of these Defender Medals, on the house! But only if you leave me alone.",
		"FirstMeeting": "Out of all the people to rescue me, why did it have to be you?",
		"BeforeDD2Tier1": "We should really do something about the Old One's Army. It might keep you away from me for a bit.",
		"AfterDD2Tier1": "I wish I could fight you off as easy as it is to fight off the Old One's Army.",
		"AfterDD2Tier2": "The Old One's Army keeps getting stronger, yet you keep speaking to me.",
		"AfterDD2Tier3": "You're doing a good job keeping the Old One's Army away, but not yourself away from me.",
		"Party_1": "This party has other people in it that isn't me, why me?",
		"Party_2": "You should sit down and have a little fun. Don't worry, you don't have to keep talking me.",
		"Graveyard1": "All these graves, and you're still not under one of them.",
		"Graveyard2": "The bar seems kinda dead tonight. I should have taken the hint.",
		"Windy1": "Go play with a kite of something.",
		"Windy2": "This shirt doesn't have buttons, you ain't gonna see anything.",
		"Storm1": "Here, take this pole and go stand outside.",
		"Storm2": "You're here and it's raining outside. It's closer to wet nightmare than a dream.",
		"Rain1": "You look like a drowned cat, if only.",
		"Rain2": "The only thing that's wet here is you."
    	},
	"TownNPCMood_DD2Bartender": {
		"Content": "I'm a 5/10 right now, the moment you stop talking to me I'll probably be a solid 10.",
		"NoHome": "It's weird how I can wear clothing like this and feel naked infront of you without a bar.",
		"FarFromHome": "I would like to pretend that being this far away from the bar makes me happy, but here you are.",
		"DislikeCrowded": "The more people around me, the higher chance there is for you to be there.",
		"HateCrowded": "You're the least entertaining person here.",
		"LoveSpace": "Finally, some peace and quiet... Oh it's you.",
		"LikeBiome": "Ahh, {BiomeName}... I like it here. ",
		"LoveBiome": "I love {BiomeName}. I would also love you to leave me alone.",
		"DislikeBiome": "I'm not a fan of {BiomeName}. I'm not a fan of you either.",
		"HateBiome": "I'd say I hate {BiomeName} more than you, but for once I disagree.",
		"LikeNPC": "I like {NPCName}, it shows you can always judge something by it not being you.",
		"LoveNPC": "{NPCName} punching you is like a wet dream to me.",
		"DislikeNPC": "People like {NPCName} is the reason God doesn’t talk to us anymore.",
		"HateNPC": "{NPCName} is my favorite person besides every other person I’ve ever met. Then there's you.",
		"LikeNPC_Princess": "{NPCName} would make a great ruler where I come from, you'll be hung first.",
	}
}