{
	"DemolitionistNames": {
		"Dolbere": "Samus",
		"Bazdin": "Samus",
		"Durim": "Samus",
		"Tordak": "Samus",
		"Garval": "Samus",
		"Morthal": "Samus",
		"Oten": "Samus",
		"Dolgen": "Samus",
		"Gimli": "Samus",
		"Gimut": "Samus",
		"Duerthen": "Samus",
		"Beldin": "Samus",
		"Jarut": "Samus",
		"Ovbere": "Samus",
		"Norkas": "Samus",
		"Dolgrim": "Samus",
		"Boften": "Samus",
		"Norsun": "Samus",
		"Dias": "Samus",
		"Fikod": "Samus",
		"Urist": "Samus",
		"Darur": "Samus"
	},
	"DemolitionistSpecialText": {
		"AfterDD2Start": "I don't see why we can't just blow up those portals.",
		"Party": "You might want to be careful today. Us dwarves tend to have pretty explosive parties.",
		"Graveyard1": "The stench of death here is worse than the skeleton-infested caverns where I work!",
        "Graveyard2": "All these piles of bones and stones... perfect for blowin' up!",
		"Windy1": "Now might not be the best time to lob grenades on the surface, my tall friend!",
		"Windy2": "You want boomerang bombs? Throw some out in that gust, they'll come back to you alright!",
		"Storm1": "BOOM! Even mother nature likes a taste of gratifying demolition!",
		"Storm2": "You shoulda seen it when lightning struck one of my carts filled with explosives!",
		"Rain1": "This is a terrible day to be a dwarf.",
		"Rain2": "ARGH! Another fuse put out by all this wet stuff! This never happens underground!"
	},
	"TownNPCMood_Demolitionist": {
		"Content": "Well, I don't feel like exploding today!",
		"NoHome": "I don't have a place to live, did I blow up my last one?",
		"FarFromHome": "I need more BOOM, I think I left it way back at home.",
		"DislikeCrowded": "I dislike the number of people here, for safety reasons, of course...",
		"HateCrowded": "Too many people around! One mistake making dynamite, and... well, they'd HATE the outcome!",
		"LoveSpace": "Ah, no one around - I can test new bombs without creating a graveyard for limbs!",
		"LikeBiome": "Dwarves are naturally drawn to {BiomeName}, it's in our blood!",
		"LoveBiome": "I love {BiomeName}.",
		"DislikeBiome": "I can't stand {BiomeName}, my fuses have trouble igniting here!",
		"HateBiome": "It reeks of death and malice in {BiomeName}, I wanna blasts holes everywhere!",
		"LikeNPC": "{NPCName} is a good friend I like, helps me load the gunpowder!",
		"LoveNPC": "I love how well {NPCName} can handle a container of fireball!",
		"DislikeNPC": "I wanna strap {NPCName} to a rocket and watch what happens!",
		"HateNPC": "I hate being around {NPCName}.",
		"LikeNPC_Princess": "WHAT... {NPCName}? Is that a new brand of nitro? Oh, HER, Yes, good lass!",
	},
	"LegacyDialog": {
		"93": "Trying to get past that {WorldEvilStone}, eh? Why not introduce it to one of these explosives!",
		"94": "Hey, have you seen a clown around?",
		"95": "There was a bomb sitting right here, and now I can't seem to find it...",
		"96": "I've got something for them zombies alright!",
		"97": "Even {ArmsDealer} wants what I'm selling!",
		"98": "Would you rather have a bullet hole or a grenade hole? That's what I thought.",
		"99": "I'm sure {Nurse} will help if you accidentally lose a limb to these.",
		"100": "Why purify the world when you can just blow it up?",
		"101": "If you throw this one in the bathtub and close all the windows, it'll clear your sinuses and pop your ears!",
		"102": "Wanna play Fuse Chicken?",
		"103": "Hey, could you sign this Griefing Waiver?",
		"104": "NO SMOKING IN HERE!!",
		"105": "Explosives are da' bomb these days.  Buy some now!",
		"106": "It's a good day to die!",
		"107": "I wonder what happens if I... (BOOM!)... Oh, sorry, did you need that leg?",
		"108": "Dynamite, my own special cure-all for what ails ya.",
		"109": "Check out my goods; they have explosive prices!"
	},
	"ItemName": {
		"GameMasterShirt": "Zero Suit Shirt",
		"GameMasterPants": "Zero Suit Leggings",
		"FlowerBoyHat": "Power Suit Helmet",
		"FlowerBoyShirt": "Power Suit Upper Body",
		"FlowerBoyPants": "Power Suit Lower Body",
	},
}